# <font color =   #0000cc> <i> Clase 12 Programación I MCD

## <font color= #0000FF> <i> SQL en Python

### <b> <font color=  #6600CC > <i> Creando una Base de Datos desde Python

In [2]:
import pyodbc  #instalar en el prompt de anaconda con pip install pyodbc
import pandas as pd #Contiene funciones que nos ayudan en el análisis de datos

server = 'PROBOOK-ROCIO'

    
try:                               
    
    conexion = pyodbc.connect(driver='{SQL server}', host = server)     
    #conexion = pyodbc.connect('DRIVER={ODBC Driver 17 for SQL Server};SERVER=' +server+';UID='+nombre_usuario+';PWD=' + password, autocommit=True)
    
    print('Conexión exitosa')

except: 

    print('La conexión no fué exitosa')
    
#Creamos un cursor para almacenar la información en memoria
cursor = conexion.cursor()

#Indicamos lo que queremos que se lleve a cabo en memoria
cursor.execute("CREATE DATABASE DB_Python3")  

#Nos aseguramos de cerrar la conexión
conexion.close()

Conexión exitosa

### <b> <font color=  #6600CC > <i> Creando una Tabla  a partir de un archivo csv

In [200]:
import pandas as pd #Contiene funciones que nos ayudan en el análisis de datos

carreras=pd.read_csv('C:/Users/rocio/Archivos en Jupyter/Bases de datos a analizar/Maraton NY completo.csv', 
                  engine='python') 
carreras

     Corredor  place  gender  age home        time
0        3475   3592    Male   52  GBR  217.483333
1       13594  13853  Female   40   NY  272.550000
2       12012  12256    Male   31  FRA  265.283333
3       10236  10457  Female   33   MI  256.150000
4        9476   9686    Male   33   NY  252.250000
..        ...    ...     ...  ...  ...         ...
995     15972  16261    Male   61  FRA  285.883333
996      1090   1131    Male   37  GBR  191.916667
997     16419  16713  Female   53  IRL  289.016667
998     13977  14241  Female   21   NY  276.050000
999      8527   8726    Male   55  GER  240.966667

[1000 rows x 6 columns]

In [25]:
(carreras)

     Corredor  place  gender  age home        time
0        3475   3592    Male   52  GBR  217.483333
1       13594  13853  Female   40   NY  272.550000
2       12012  12256    Male   31  FRA  265.283333
3       10236  10457  Female   33   MI  256.150000
4        9476   9686    Male   33   NY  252.250000
..        ...    ...     ...  ...  ...         ...
995     15972  16261    Male   61  FRA  285.883333
996      1090   1131    Male   37  GBR  191.916667
997     16419  16713  Female   53  IRL  289.016667
998     13977  14241  Female   21   NY  276.050000
999      8527   8726    Male   55  GER  240.966667

[1000 rows x 6 columns]

In [20]:
Lista_valores =  carreras.values.tolist()
tuplas_lista = tuple(Lista_valores) 
tuplas_lista

([3475, 3592, 'Male', 52, 'GBR', 217.4833333],
 [13594, 13853, 'Female', 40, 'NY', 272.55],
 [12012, 12256, 'Male', 31, 'FRA', 265.2833333],
 [10236, 10457, 'Female', 33, 'MI', 256.15],
 [9476, 9686, 'Male', 33, 'NY', 252.25],
 [1720, 1784, 'Male', 40, 'NJ', 201.9666667],
 [15736, 16020, 'Female', 30, 'CA', 283.5666667],
 [10580, 10805, 'Male', 27, 'GBR', 255.8833333],
 [11957, 12201, 'Male', 42, 'NED', 264.25],
 [18933, 19266, 'Male', 48, 'B.C', 306.6833333],
 [14956, 15229, 'Female', 63, 'GBR', 281.2666667],
 [14987, 15260, 'Male', 49, 'ITA', 280.25],
 [10447, 10670, 'Male', 33, 'NY', 258.3333333],
 [10435, 10658, 'Male', 43, 'NY', 257.1333333],
 [191, 200, 'Male', 40, 'GER', 163.9333333],
 [9962, 10178, 'Male', 33, 'NY', 253.6166667],
 [2379, 2467, 'Male', 40, 'FRA', 206.2666667],
 [10505, 10729, 'Male', 36, 'NY', 257.9333333],
 [11853, 12093, 'Male', 49, 'SWE', 262.1333333],
 [12181, 12428, 'Female', 34, 'NY', 264.2166667],
 [2633, 2730, 'Male', 26, 'DEN', 209.7333333],
 [11935, 12179, 'Male', 50, 'NED', 265.25],
 [20116, 20460, 'Male', 33, 'NJ', 315.2333333],
 [23043, 23413, 'Male', 71, 'FL', 414.7],
 [19584, 19921, 'Female', 39, 'GER', 309.2666667],
 [11640, 11878, 'Female', 28, 'GBR', 261.2666667],
 [17363, 17683, 'Male', 52, 'GBR', 295.3166667],
 [17611, 17933, 'Male', 28, 'NED', 294.8333333],
 [9935, 10151, 'Male', 52, 'CA', 254.25],
 [8713, 8915, 'Male', 41, 'BRA', 248.95],
 [204, 213, 'Male', 35, 'VA', 164.5],
 [21293, 21647, 'Female', 39, 'NY', 334.0166667],
 [2624, 2721, 'Male', 48, 'FRA', 210.9],
 [14357, 14623, 'Male', 33, 'NED', 271.0666667],
 [4583, 4715, 'Male', 35, 'MA', 226.4666667],
 [10059, 10277, 'Male', 46, 'PR', 256.7166667],
 [12379, 12630, 'Male', 30, 'NY', 264.8333333],
 [3633, 3751, 'Male', 42, 'KY', 219.1333333],
 [6695, 6867, 'Male', 31, 'ITA', 237.7],
 [711, 737, 'Male', 40, 'IL', 184.3],
 [10746, 10972, 'Male', 41, 'NY', 253.75],
 [12716, 12968, 'Male', 33, 'NY', 267.4666667],
 [17454, 17775, 'Male', 37, 'NY', 289.6166667],
 [10114, 10333, 'Female', 25, 'RSA', 256.9666667],
 [16764, 17068, 'Male', 39, 'GBR', 288.0333333],
 [14424, 14690, 'Male', 34, 'NY', 277.4],
 [19915, 20253, 'Female', 42, 'NY', 316.3333333],
 [13047, 13301, 'Male', 44, 'ITA', 271.3666667],
 [8626, 8827, 'Male', 45, 'MA', 248.0833333],
 [805, 836, 'Male', 30, 'NY', 186.45],
 [6955, 7132, 'Male', 33, 'CA', 237.2],
 [20135, 20479, 'Female', 39, 'CAN', 318.6333333],
 [23128, 23499, 'Male', 67, 'GA', 431.6166667],
 [4833, 4969, 'Male', 35, 'GBR', 227.0166667],
 [22111, 22469, 'Female', 42, 'NY', 353.1],
 [15975, 16264, 'Female', 30, 'MA', 284.0166667],
 [22968, 23338, 'Female', 31, 'NY', 407.4333333],
 [9482, 9692, 'Male', 44, 'FRA', 252.6333333],
 [15726, 16010, 'Male', 44, 'MEX', 283.75],
 [3388, 3502, 'Female', 38, 'GBR', 218.3833333],
 [2504, 2596, 'Male', 27, 'MEX', 207.0166667],
 [23231, 23603, 'Female', 58, 'NY', 467.1833333],
 [5755, 5909, 'Male', 36, 'NY', 231.4166667],
 [12426, 12677, 'Male', 36, 'NED', 265.1333333],
 [488, 507, 'Male', 33, 'CT', 177.3666667],
 [16982, 17290, 'Male', 40, 'NY', 292.1333333],
 [5918, 6077, 'Female', 28, 'NY', 234.2],
 [12031, 12275, 'Female', 32, 'NY', 264.5],
 [3855, 3979, 'Male', 36, 'FRA', 221.3833333],
 [8902, 9104, 'Female', 23, 'NY', 247.3166667],
 [6523, 6693, 'Male', 33, 'MA', 236.2333333],
 [6080, 6240, 'Male', 42, 'NY', 235.7333333],
 [15601, 15883, 'Male', 41, 'GBR', 284.25],
 [5617, 5768, 'Female', 40, 'MEX', 232.3833333],
 [11867, 12107, 'Male', 40, 'GBR', 265.1166667],
 [5179, 5322, 'Male', 33, 'ITA', 230.4166667],
 [20590, 20939, 'Female', 25, 'KOR', 327.1666667],
 [20343, 20690, 'Male', 27, 'GBR', 321.55],
 [12955, 13208, 'Male', 51, 'MEX', 268.9666667],
 [10601, 10826, 'Female', 56, 'SWE', 258.5333333],
 [8855, 9057, 'Male', 48, 'GER', 249.2666667],
 [20719, 21068, 'Male', 33, 'NY', 326.9333333],
 [12715, 12967, 'Male', 51, 'GER', 268.1833333],
 [10962, 11191, 'Male', 51, 'RSA', 256.9833333],
 [11270, 11503, 'Male', 32, 'NY', 256.5],
 [11860, 12100, 'Female', 32, 'NY', 263.85],
 [15203, 15480, 'Male', 69, 'FRA', 276.5],
 [18838, 19171, 'Male', 44, 'ITA', 306.4166667],
 [6981, 7158, 'Female', 38, 'GBR', 239.55],
 [11141, 11372, 'Female', 31, 'GBR', 259.2],
 [14695, 14966, 'Male', 53, 'NED', 277.6833333],
 [4450, 4582, 'Male', 44, 'MO', 219.7666667],
 [4675, 4808, 'Male', 44, 'NY', 227.2],
 [13346, 13602, 'Male', 51, 'NM', 272.2166667],
 [400, 417, 'Male', 33, 'NY', 175.3666667],
 [10217, 10437, 'Female', 41, 'GBR', 254.5333333],
 [4993, 5131, 'Male', 33, 'NY', 226.7666667],
 [3476, 3593, 'Male', 32, 'NY', 219.05],
 [1927, 1996, 'Male', 30, 'NZL', 204.6333333],
 [18859, 19192, 'Male', 40, 'GBR', 305.2833333],
 [11424, 11659, 'Male', 60, 'NY', 262.7666667],
 [6944, 7121, 'Male', 42, 'LAN', 238.95],
 [20992, 21344, 'Female', 65, 'JPN', 328.9333333],
 [358, 371, 'Male', 26, 'GER', 173.6],
 [16106, 16397, 'Female', 38, 'GER', 287.6333333],
 [22743, 23112, 'Male', 81, 'ITA', 389.0],
 [4784, 4919, 'Male', 31, 'NJ', 226.8],
 [5647, 5798, 'Female', 33, 'NY', 229.3166667],
 [7941, 8133, 'Male', 61, 'FRA', 244.3],
 [15924, 16212, 'Female', 40, 'NY', 284.8166667],
 [6091, 6251, 'Male', 32, 'IL', 234.5833333],
 [510, 532, 'Male', 66, 'ESP', 178.5833333],
 [11198, 11430, 'Male', 59, 'NY', 262.6833333],
 [11001, 11230, 'Male', 40, 'FRA', 259.2333333],
 [8706, 8908, 'Male', 43, 'MI', 247.95],
 [23003, 23373, 'Male', 18, 'MEX', 408.3333333],
 [535, 558, 'Male', 60, 'ITA', 179.5166667],
 [22810, 23180, 'Female', 36, 'GBR', 394.0833333],
 [9022, 9224, 'Male', 44, 'NJ', 251.3666667],
 [1389, 1441, 'Male', 34, 'MI', 197.2],
 [5362, 5508, 'Male', 41, 'CAN', 230.35],
 [13266, 13522, 'Male', 44, 'PA', 268.4166667],
 [4904, 5041, 'Male', 25, 'NY', 228.2833333],
 [8486, 8685, 'Female', 21, 'FRA', 248.0333333],
 [495, 517, 'Male', 32, 'SUI', 177.7166667],
 [12666, 12918, 'Male', 38, 'NY', 266.8333333],
 [17051, 17360, 'Male', 33, 'NY', 291.3833333],
 [2519, 2613, 'Female', 22, 'OR', 209.0666667],
 [22508, 22873, 'Female', 33, 'TX', 369.35],
 [20736, 21085, 'Male', 61, 'FL', 326.7],
 [11393, 11627, 'Male', 33, 'NY', 258.0333333],
 [22565, 22932, 'Female', 41, 'LA', 371.9833333],
 [20645, 20994, 'Male', 45, 'NY', 325.95],
 [9649, 9862, 'Female', 34, 'CAN', 252.3666667],
 [16182, 16475, 'Male', 36, 'GBR', 286.8166667],
 [493, 515, 'Male', 29, 'ITA', 177.6333333],
 [20643, 20992, 'Male', 43, 'NY', 326.05],
 [14963, 15236, 'Male', 21, 'FL', 276.65],
 [8556, 8756, 'Male', 52, 'DEN', 246.9666667],
 [4751, 4885, 'Female', 41, 'NY', 225.0833333],
 [13853, 14115, 'Male', 59, 'FRA', 273.9833333],
 [13539, 13798, 'Male', 56, 'SUI', 271.9666667],
 [14262, 14528, 'Male', 31, 'NY', 270.6666667],
 [1688, 1752, 'Male', 43, 'NY', 201.95],
 [13459, 13718, 'Female', 27, 'GER', 270.05],
 [20009, 20350, 'Female', 28, 'NJ', 320.5333333],
 [6444, 6613, 'Male', 54, 'FRA', 236.4333333],
 [10527, 10752, 'Male', 38, 'NJ', 258.0],
 [8526, 8725, 'Male', 31, 'MA', 247.4166667],
 [11896, 12137, 'Male', 44, 'VEN', 264.9166667],
 [854, 885, 'Male', 40, 'FRA', 187.4166667],
 [956, 991, 'Male', 35, 'FRA', 189.4666667],
 [23145, 23516, 'Male', 76, 'NY', 430.8166667],
 [23094, 23464, 'Male', 51, 'NY', 426.8833333],
 [17753, 18076, 'Male', 51, 'NY', 297.2],
 [23230, 23602, 'Male', 73, 'NY', 460.8],
 [17141, 17454, 'Female', 53, 'GA', 289.2666667],
 [13212, 13468, 'Female', 29, 'NED', 271.0666667],
 [4447, 4579, 'Male', 42, 'MEX', 223.05],
 [10115, 10334, 'Female', 44, 'NY', 256.4833333],
 [21284, 21638, 'Male', 43, 'CA', 332.2333333],
 [16809, 17113, 'Female', 33, 'FL', 290.3],
 [8510, 8709, 'Male', 47, 'FRA', 247.9333333],
 [1525, 1583, 'Male', 53, 'NJ', 199.5833333],
 [22073, 22431, 'Female', 32, 'GBR', 353.2166667],
 [22509, 22874, 'Female', 51, 'TX', 369.35],
 [19034, 19366, 'Female', 34, 'FRA', 307.5333333],
 [6555, 6725, 'Female', 36, 'NY', 235.0833333],
 [18172, 18501, 'Male', 40, 'GBR', 299.1333333],
 [5076, 5215, 'Male', 48, 'ITA', 229.5166667],
 [13184, 13440, 'Male', 31, 'PER', 271.3666667],
 [14170, 14436, 'Male', 30, 'NY', 274.4333333],
 [9746, 9959, 'Male', 30, 'IL', 251.85],
 [11733, 11973, 'Male', 31, 'GA', 261.8333333],
 [6656, 6828, 'Female', 25, 'NY', 238.3333333],
 [23143, 23514, 'Male', 38, 'IRL', 433.8833333],
 [3849, 3972, 'Female', 44, 'GBR', 220.25],
 [6407, 6576, 'Male', 53, 'GER', 231.8],
 [6593, 6763, 'Male', 38, 'NY', 237.5333333],
 [8282, 8480, 'Female', 42, 'NJ', 244.95],
 [20669, 21018, 'Male', 70, 'JPN', 322.9833333],
 [8622, 8823, 'Female', 20, 'MEX', 244.8833333],
 [5933, 6092, 'Male', 51, 'NJ', 234.0166667],
 [13819, 14081, 'Male', 29, 'MN', 272.9833333],
 [11619, 11857, 'Male', 31, 'MN', 259.6166667],
 [9254, 9457, 'Male', 42, 'FRA', 251.7833333],
 [14824, 15096, 'Female', 33, 'IL', 280.0666667],
 [22506, 22871, 'Female', 32, 'NY', 370.6],
 [14304, 14570, 'Female', 26, 'DC', 277.6],
 [14356, 14622, 'Male', 51, 'FRA', 277.6833333],
 [9697, 9910, 'Male', 53, 'NED', 253.2833333],
 [13837, 14099, 'Female', 28, 'NY', 274.8833333],
 [20516, 20863, 'Female', 24, 'NJ', 324.15],
 [21476, 21831, 'Female', 42, 'CA', 341.7666667],
 [22009, 22365, 'Female', 34, 'NY', 350.25],
 [17221, 17535, 'Female', 55, 'TN', 295.5],
 [8023, 8216, 'Female', 40, 'NC', 245.5166667],
 [17013, 17322, 'Male', 29, 'GBR', 293.6666667],
 [18786, 19119, 'Male', 33, 'GA', 302.55],
 [14521, 14787, 'Female', 30, 'MA', 275.1],
 [15389, 15669, 'Male', 41, 'NY', 282.6],
 [21214, 21568, 'Male', 22, 'NY', 330.5666667],
 [8057, 8250, 'Male', 33, 'DC', 242.15],
 [253, 265, 'Male', 29, 'FIN', 168.1833333],
 [8439, 8638, 'Male', 42, 'NJ', 244.7166667],
 [8107, 8300, 'Female', 32, 'MA', 246.2666667],
 [14984, 15257, 'Female', 20, 'CA', 278.8],
 [347, 359, 'Male', 38, 'FRA', 173.15],
 [14856, 15129, 'Female', 30, 'JPN', 279.8166667],
 [2971, 3077, 'Female', 34, 'NED', 214.6333333],
 [14637, 14906, 'Male', 35, 'GBR', 278.2166667],
 [7947, 8139, 'Female', 30, 'NJ', 244.7666667],
 [12609, 12861, 'Female', 44, 'TX', 268.0666667],
 [13101, 13355, 'Male', 51, 'FRA', 269.95],
 [1259, 1306, 'Male', 44, 'NY', 195.35],
 [13296, 13552, 'Female', 43, 'CA', 272.4],
 [14312, 14578, 'Male', 49, 'CAN', 276.7833333],
 [1544, 1603, 'Male', 42, 'MA', 198.2166667],
 [13172, 13427, 'Male', 32, 'NY', 272.0166667],
 [18088, 18417, 'Female', 35, 'PA', 298.35],
 [11741, 11981, 'Female', 38, 'NY', 262.6833333],
 [20901, 21253, 'Male', 39, 'NED', 330.6166667],
 [12110, 12354, 'Female', 48, 'NOR', 265.4],
 [9335, 9541, 'Male', 36, 'CT', 253.3],
 [4648, 4781, 'Male', 56, 'FRA', 224.65],
 [17361, 17681, 'Female', 31, 'CT', 295.7166667],
 [16803, 17107, 'Female', 30, 'NJ', 291.0666667],
 [3460, 3577, 'Male', 33, 'FL', 218.2833333],
 [17478, 17799, 'Male', 52, 'FL', 289.7],
 [6932, 7109, 'Male', 23, 'GBR', 238.2333333],
 [10380, 10603, 'Male', 39, 'NED', 251.0833333],
 [22333, 22694, 'Male', 49, 'NY', 366.5833333],
 [7087, 7267, 'Male', 32, 'CA', 238.25],
 [2176, 2255, 'Female', 32, 'NY', 207.15],
 [19716, 20054, 'Male', 29, 'ITA', 313.3],
 [19305, 19641, 'Male', 33, 'ITA', 310.7166667],
 [6398, 6567, 'Male', 54, 'GBR', 235.5333333],
 [12038, 12282, 'Male', 36, 'FRA', 265.5],
 [4300, 4429, 'Male', 38, 'VEN', 224.7166667],
 [837, 868, 'Male', 40, 'NY', 186.9166667],
 [7035, 7215, 'Male', 33, 'OH', 239.0666667],
 [18565, 18895, 'Female', 32, 'CA', 300.0166667],
 [13022, 13276, 'Male', 40, 'DEN', 270.0333333],
 [623, 646, 'Male', 24, 'JPN', 181.9],
 [19271, 19607, 'Male', 41, 'NJ', 305.95],
 [23180, 23551, 'Female', 48, 'IRL', 439.8333333],
 [2003, 2075, 'Male', 33, 'NJ', 205.2666667],
 [17850, 18175, 'Male', 67, 'ESP', 296.6333333],
 [10742, 10968, 'Female', 22, 'CA', 258.7],
 [18260, 18589, 'Male', 5, 'AK', 302.6833333],
 [15161, 15436, 'Female', 40, 'NY', 281.1333333],
 [5120, 5260, 'Male', 56, 'ITA', 230.05],
 [8987, 9189, 'Female', 30, 'NY', 248.7666667],
 [5134, 5276, 'Male', 26, 'NY', 227.8],
 [10474, 10698, 'Male', 53, 'NY', 258.15],
 [14177, 14443, 'Female', 38, 'NED', 272.15],
 [7855, 8043, 'Male', 41, 'FRA', 243.6],
 [16822, 17127, 'Male', 54, 'OR', 290.6166667],
 [18998, 19330, 'Male', 43, 'NY', 306.2833333],
 [17059, 17368, 'Female', 24, 'NY', 288.55],
 [991, 1028, 'Male', 34, 'ITA', 189.8166667],
 [10860, 11088, 'Female', 40, 'FL', 257.7833333],
 [10593, 10818, 'Male', 27, 'NY', 259.2833333],
 [23221, 23593, 'Male', 51, 'NY', 454.65],
 [2806, 2906, 'Male', 23, 'NY', 212.65],
 [4576, 4708, 'Female', 43, 'OH', 223.4333333],
 [15630, 15912, 'Male', 41, 'MO', 285.6166667],
 [13884, 14146, 'Male', 40, 'MA', 270.0666667],
 [8782, 8984, 'Male', 47, 'FRA', 247.1333333],
 [10116, 10335, 'Male', 21, 'IRL', 256.2],
 [7241, 7424, 'Female', 30, 'GBR', 239.4166667],
 [4528, 4660, 'Male', 33, 'FL', 226.2333333],
 [22746, 23115, 'Female', 20, 'GBR', 387.4],
 [16932, 17239, 'Male', 55, 'NY', 293.0166667],
 [6007, 6166, 'Male', 32, 'NY', 233.4833333],
 [9897, 10112, 'Female', 31, 'NY', 250.4333333],
 [20111, 20455, 'Female', 31, 'MA', 316.7],
 [16376, 16670, 'Male', 31, 'NJ', 288.8166667],
 [13256, 13512, 'Male', 36, 'NJ', 272.4666667],
 [10377, 10600, 'Female', 36, 'JPN', 258.3333333],
 [20137, 20481, 'Male', 72, 'ARG', 321.8666667],
 [22695, 23063, 'Male', 41, 'LA', 382.9333333],
 [18666, 18997, 'Male', 58, 'NY', 305.7333333],
 [13718, 13979, 'Male', 32, 'GBR', 272.5666667],
 [13120, 13374, 'Female', 35, 'NY', 271.4],
 [20511, 20858, 'Male', 42, 'ITA', 321.35],
 [1943, 2012, 'Female', 30, 'NY', 204.9333333],
 [13451, 13710, 'Male', 33, 'NY', 272.8166667],
 [3563, 3681, 'Male', 44, 'GER', 217.4666667],
 [17033, 17342, 'Female', 32, 'NY', 287.8666667],
 [17444, 17765, 'Male', 38, 'NED', 293.05],
 [2691, 2789, 'Male', 32, 'PA', 210.65],
 [3265, 3378, 'Male', 48, 'CHI', 217.35],
 [6231, 6395, 'Male', 38, 'AUS', 230.75],
 [6766, 6940, 'Male', 31, 'NJ', 237.8833333],
 [3910, 4034, 'Male', 32, 'NY', 221.15],
 [22578, 22945, 'Female', 33, 'NJ', 379.85],
 [22829, 23199, 'Male', 37, 'NJ', 398.2666667],
 [15360, 15639, 'Male', 50, 'NY', 283.7833333],
 [1014, 1054, 'Male', 52, 'PR', 191.05],
 [16775, 17079, 'Female', 33, 'BEL', 290.3333333],
 [5550, 5701, 'Male', 32, 'MA', 230.1],
 [5942, 6101, 'Male', 22, 'GBR', 233.3833333],
 [6233, 6397, 'Male', 43, 'NY', 235.4833333],
 [19089, 19422, 'Male', 34, 'GA', 304.9666667],
 [13834, 14096, 'Male', 46, 'MEX', 273.5166667],
 [19636, 19973, 'Male', 34, 'NY', 315.75],
 [5817, 5974, 'Male', 49, 'MEX', 234.3166667],
 [4517, 4649, 'Male', 31, 'CAN', 225.2833333],
 [9747, 9960, 'Male', 58, 'DEN', 254.2166667],
 [23149, 23520, 'Female', 32, 'GBR', 434.1833333],
 [6742, 6915, 'Male', 42, 'VA', 238.85],
 [5731, 5883, 'Male', 43, 'ITA', 233.75],
 [10932, 11160, 'Male', 43, 'IL', 258.9166667],
 [11627, 11865, 'Male', 41, 'CA', 262.3666667],
 [7895, 8087, 'Male', 30, 'NJ', 244.05],
 [18618, 18949, 'Male', 66, 'GER', 302.5166667],
 [21125, 21478, 'Female', 53, 'FRA', 330.0666667],
 [22241, 22599, 'Male', 30, 'TX', 359.45],
 [19826, 20164, 'Female', 31, 'NJ', 316.0333333],
 [22979, 23349, 'Female', 31, 'CA', 404.55],
 [2452, 2543, 'Male', 33, 'NY', 208.7833333],
 [3565, 3683, 'Female', 30, 'NY', 219.5],
 [5192, 5335, 'Male', 33, 'NY', 229.35],
 [6552, 6722, 'Male', 24, 'NY', 230.5333333],
 [19912, 20250, 'Male', 70, 'MI', 318.05],
 [5705, 5857, 'Female', 27, 'NY', 233.45],
 [23090, 23460, 'Male', 62, 'FL', 423.0166667],
 [20491, 20838, 'Female', 21, 'GBR', 321.2333333],
 [9544, 9757, 'Male', 46, 'VEN', 254.0666667],
 [7568, 7753, 'Female', 33, 'MA', 240.0333333],
 [20973, 21325, 'Male', 46, 'NY', 334.2166667],
 [8784, 8986, 'Male', 50, 'FRA', 247.2833333],
 [3029, 3137, 'Male', 40, 'CT', 214.3666667],
 [14400, 14666, 'Male', 39, 'GBR', 275.9166667],
 [19376, 19712, 'Female', 23, 'NY', 305.6333333],
 [17911, 18237, 'Male', 52, 'ITA', 298.1833333],
 [1759, 1825, 'Male', 36, 'FRA', 202.5333333],
 [13335, 13591, 'Female', 35, 'NY', 268.2333333],
 [2104, 2181, 'Male', 29, 'WA', 205.1833333],
 [19588, 19925, 'Male', 29, 'IL', 312.5],
 [3521, 3638, 'Male', 53, 'FRA', 218.9666667],
 [3443, 3559, 'Male', 44, 'PA', 218.6666667],
 [20774, 21124, 'Male', 46, 'FRA', 325.6],
 [17786, 18111, 'Male', 54, 'NY', 295.2],
 [15923, 16211, 'Male', 41, 'NY', 284.4],
 [9204, 9407, 'Male', 47, 'VEN', 251.9666667],
 [10297, 10520, 'Female', 40, 'NY', 258.4],
 [8476, 8675, 'Male', 42, 'GER', 247.1666667],
 [21197, 21551, 'Male', 37, 'GBR', 332.8166667],
 [4329, 4458, 'Female', 31, 'IL', 224.8666667],
 [8416, 8615, 'Male', 50, 'FRA', 242.2666667],
 [1702, 1766, 'Male', 35, 'CHI', 201.4666667],
 [6966, 7143, 'Male', 50, 'WA', 239.0833333],
 [18374, 18703, 'Male', 40, 'VA', 298.3333333],
 [15515, 15795, 'Male', 32, 'DC', 283.7666667],
 [11573, 11810, 'Male', 62, 'ITA', 263.2],
 [19246, 19581, 'Male', 46, 'FIN', 305.9],
 [8114, 8307, 'Male', 34, 'ITA', 244.5666667],
 [15339, 15618, 'Female', 30, 'NY', 282.25],
 [969, 1004, 'Male', 26, 'NY', 189.8833333],
 [5161, 5304, 'Male', 31, 'CAN', 230.1333333],
 [19162, 19496, 'Male', 55, 'NY', 310.2],
 [21070, 21422, 'Male', 58, 'ITA', 332.6833333],
 [5892, 6051, 'Female', 41, 'ITA', 234.3],
 [16603, 16905, 'Male', 47, 'NED', 285.2833333],
 [23282, 23654, 'Male', 69, 'NY', 508.0833333],
 [17737, 18060, 'Male', 33, 'GA', 296.45],
 [4793, 4928, 'Male', 54, 'MD', 226.4333333],
 [9378, 9586, 'Male', 53, 'NC', 246.85],
 [22207, 22565, 'Male', 50, 'AZ', 359.4666667],
 [4318, 4447, 'Male', 46, 'GER', 224.4166667],
 [7605, 7790, 'Male', 31, 'VA', 241.5666667],
 [13406, 13664, 'Male', 35, 'SUI', 266.45],
 [17597, 17918, 'Male', 43, 'NY', 291.6166667],
 [6037, 6196, 'Male', 32, 'TX', 234.0166667],
 [861, 892, 'Female', 30, 'CA', 187.7333333],
 [21157, 21510, 'Female', 56, 'FRA', 333.2833333],
 [20271, 20617, 'Female', 21, 'GBR', 319.0333333],
 [19547, 19884, 'Male', 41, 'NY', 313.3666667],
 [18714, 19045, 'Female', 33, 'TX', 305.3],
 [9778, 9991, 'Male', 30, 'GBR', 250.8],
 [2222, 2303, 'Male', 23, 'NY', 206.5666667],
 [9260, 9463, 'Female', 30, 'MD', 250.95],
 [12686, 12938, 'Male', 34, 'NY', 264.9833333],
 [16292, 16586, 'Male', 39, 'TX', 288.0666667],
 [21799, 22154, 'Female', 32, 'NY', 350.7833333],
 [22640, 23008, 'Male', 50, 'CA', 379.3],
 [22378, 22742, 'Female', 31, 'TX', 363.4666667],
 [3018, 3126, 'Male', 40, 'NY', 215.1333333],
 [9178, 9380, 'Male', 48, 'NOR', 251.8333333],
 [21467, 21822, 'Male', 36, 'CT', 343.6],
 [7728, 7915, 'Male', 34, 'MEX', 240.6833333],
 [21586, 21941, 'Male', 69, 'SD', 339.05],
 [17523, 17844, 'Male', 47, 'PER', 295.5166667],
 [13894, 14156, 'Female', 29, 'DEN', 274.2333333],
 [14366, 14632, 'Female', 49, 'FRA', 277.7666667],
 [4367, 4496, 'Male', 40, 'FRA', 224.8],
 [19024, 19356, 'Male', 60, 'GER', 302.4666667],
 [12549, 12800, 'Male', 37, 'GBR', 265.7666667],
 [3695, 3814, 'Female', 36, 'CT', 220.5833333],
 [2734, 2833, 'Male', 34, 'ITA', 212.1666667],
 [7725, 7912, 'Male', 30, 'MA', 242.4],
 [10426, 10649, 'Female', 33, 'NY', 258.9666667],
 [14628, 14897, 'Male', 39, 'NY', 277.55],
 [21569, 21924, 'Male', 50, 'NY', 339.9833333],
 [9373, 9581, 'Male', 32, 'NJ', 253.3166667],
 [16144, 16437, 'Female', 33, 'VA', 287.4666667],
 [20740, 21089, 'Male', 42, 'NY', 330.4166667],
 [4243, 4370, 'Male', 48, 'ESP', 224.5333333],
 [8386, 8585, 'Male', 61, 'NJ', 247.75],
 [796, 827, 'Male', 36, 'ITA', 186.3833333],
 [8331, 8529, 'Male', 30, 'NY', 245.4],
 [286, 298, 'Male', 33, 'NY', 169.6666667],
 [9128, 9330, 'Male', 48, 'OR', 249.2],
 [476, 495, 'Male', 46, 'FRA', 177.6166667],
 [11496, 11732, 'Male', 51, 'FRA', 261.8],
 [21089, 21441, 'Male', 52, 'NY', 330.8],
 [4643, 4776, 'Male', 36, 'NED', 225.45],
 [20945, 21297, 'Female', 43, 'NJ', 328.0],
 [17339, 17658, 'Male', 32, 'NY', 292.8666667],
 [11719, 11959, 'Female', 40, 'AUT', 262.95],
 [15579, 15860, 'Female', 34, 'CAN', 283.8],
 [19993, 20334, 'Male', 22, 'SC', 313.1666667],
 [13314, 13570, 'Female', 30, 'CAN', 270.2],
 [16212, 16506, 'Female', 33, 'NED', 284.4],
 [13088, 13342, 'Female', 22, 'VA', 268.5166667],
 [21900, 22255, 'Female', 33, 'PER', 347.6333333],
 [354, 367, 'Male', 43, 'CA', 173.3666667],
 [19880, 20218, 'Female', 50, 'SWE', 316.5666667],
 [7823, 8010, 'Female', 41, 'CAN', 244.45],
 [12431, 12682, 'Male', 31, 'NY', 266.1],

In [21]:
type(tuplas_lista)

tuple

In [28]:
import pyodbc  #instalar en el prompt de anaconda con pip install pyodbc

server = 'PROBOOK-ROCIO'
bd = 'DB_PYTHON'
    
try:                               
    
    conexion = pyodbc.connect(driver='{SQL server}', host = server, database = bd)                              
    print('Conexión exitosa')

except: 

    print('La conexión no fué exitosa')
    
#Creamos un cursor para almacenar la información en memoria
cursor = conexion.cursor()

cursor.execute("CREATE TABLE MaratonNY_Python(Corredor INTEGER, place INTEGER, gender VARCHAR(25), age INTEGER, home VARCHAR(255), tiempo FLOAT, PRIMARY KEY (Corredor))")

cursor.executemany("INSERT INTO MaratonNY_Python VALUES(?,?,?,?,?,?)", tuplas_lista)

#Guardamos los cambios hechos a la Base de Datos
cursor.commit()

#Nos aseguramos de cerrar la conexión
conexion.close()

Conexión exitosa

## <font color= #0000FF> <i> Consultas de SQL en Python

### <b> <font color=  #6600CC > <i> Select y From

In [29]:

server = 'PROBOOK-ROCIO'
bd = 'DB_Python2'
    
try:                               
    
    conexion = pyodbc.connect(driver='{SQL server}', host = server, database = bd)                              
    print('Conexión exitosa')

except: 

    print('La conexión no fué exitosa')
    

    
maraton_todos = pd.read_sql("SELECT * FROM MaratonNY", conexion)


maraton_edad = pd.read_sql("SELECT age FROM MaratonNY", conexion)

maraton_edad_gender = pd.read_sql("SELECT age, gender FROM MaratonNY", conexion)

#Nos aseguramos de cerrar la conexión
conexion.close()

Conexión exitosa

In [30]:
maraton_todos

     Corredor  place  gender  age home        time
0          53     54    Male   37   AK  147.333333
1         100    104    Male   27   NJ  156.000000
2         112    116    Male   43   CO  157.583333
3         191    200    Male   40  GER  163.933333
4         204    213    Male   35   VA  164.500000
..        ...    ...     ...  ...  ...         ...
995     23255  23627    Male   45  GBR  478.016667
996     23269  23641    Male   40  IRL  491.566667
997     23273  23645  Female   46   NY  501.550000
998     23282  23654    Male   69   NY  508.083333
999     23290  23662  Female   69   NY  566.783333

[1000 rows x 6 columns]

In [31]:
maraton_edad

     age
0     37
1     27
2     43
3     40
4     35
..   ...
995   45
996   40
997   46
998   69
999   69

[1000 rows x 1 columns]

In [32]:
maraton_edad_gender

     age  gender
0     37    Male
1     27    Male
2     43    Male
3     40    Male
4     35    Male
..   ...     ...
995   45    Male
996   40    Male
997   46  Female
998   69    Male
999   69  Female

[1000 rows x 2 columns]

### <b> <font color=  #6600CC > <i> Where, igual a, diferente a, Like y Not Like

In [53]:

server = 'PROBOOK-ROCIO'
bd = 'DB_Python2'
    
try:                               
    
    conexion = pyodbc.connect(driver='{SQL server}', host = server, database = bd)                              
    print('Conexión exitosa')

except: 

    print('La conexión no fué exitosa')
    

### IMPORTANTE: Utilizar comillas dobles para indicar el inicio y el final de la sentencia y comillas  sencillas 
### para indicar los valores de las variables que estamos buscando 
Casados = pd.read_sql("SELECT * FROM Datos_Personales_Python WHERE Estado_Civil = 'Married' ", conexion)

#Buscando valores "diferentes a" 
No_Casados = pd.read_sql("SELECT * FROM Datos_Personales_Python WHERE Estado_Civil != 'Married' ", conexion)

#Sentencia "like"
gmail = pd.read_sql("SELECT * FROM Datos_Personales_Python WHERE Correo like '%gmail%' ", conexion)

alumnos_A = pd.read_sql("SELECT * FROM Datos_Personales_Python WHERE Nombre like 'A%' ", conexion)


#Sentencia "Not like"

alumnos_not_A = pd.read_sql("SELECT * FROM Datos_Personales_Python WHERE Nombre not like 'A%' ", conexion)

#Nos aseguramos de cerrar la conexión
conexion.close()

Conexión exitosa

In [54]:
Casados

,Id_num,Nombre,Correo,Direccion,Ciudad,Telefono,Genero,Estado_Civil
0,2,Vanita Kelleher,Jude_High169@gmail.com,NULL,Concord,(684) 186-0087,F,Married
1,4,Miyoko Mckinney,Alarcon@gmail.com,925 Hope St,Scottdale,(868) 864-8718,M,Married
2,10,Stanford Sullivan,Shayne_Britton589@gmail.com,3836 Hunting Hill Pkwy,Beavercreek,(812) 252-0427,F,Married
3,11,Nathan Salisbury,mxwygtmf_ahjpwboxdy@gmail.com,3603 Stonewood Ct,Dublin,(977) 813-8110,M,Married
4,17,Ariel Hermann,rfgxqoso9811@gmail.com,683 SW Stonewood Way,Brigantine,(552) 037-7186,M,Married
5,18,Adam Maddox,Violette_Maxey368@gmail.com,2254 W Riverview Lane,Merrill,(247) 811-3933,F,Married
6,25,Jerome Gipson,Killian@outlook.com,NULL,Chehalis,NULL,F,Married
7,26,Lilla Perez,Maness@outlook.com,NULL,Big Rapids,(104) 855-4937,M,Married
8,27,Josephine Norwood,KimberlieCrocker@outlook.com,81 Beachwood Lane,Lindale,(273) 600-9445,M,Married
9,29,Curtis Hutson,Tiffanie.Romero27@outlook.com,725 NW Waterview Way,Cathedral City,(442) 344-5339,M,Married
10,30,Melia Gates,Gable@gmail.com,75 Beachwood Way,San Angelo,(535) 013-0514,F,Married
11,32,Alida Jobe,Raynor8@gmail.com,959 East Meadowview Drive,Snoqualmie,(610) 362-5075,M,Married
12,34,Reba Gregg,Batson@gmail.com,2008 3rd Ct,Valdosta,(845) 678-6842,M,Married
13,36,Oliva Coble,SeeleyJ@gmail.com,2274 E Lake Ct,Ringwood,(135) 721-2385,M,Married
14,38,Bud Grubbs,Monty.Swan5@outlook.com,138 1st Drive,Mahtomedi,(649) 790-3129,M,Married
15,39,Newton Graves,SteinerK@gmail.com,2747 W Hope Hwy,Star,(861) 866-2316,F,Married
16,42,Malcolm Coward,Caballero313@gmail.com,238 Pine Tree Dr,Park Ridge,NULL,M,Married
17,47,Hubert Waldrop,NULL,2147 Riverview Dr,Aberdeen,(995) 647-4714,F,Married
18,50,Sonia Ackerman,Mcnamara616@gmail.com,3566 Old Hope Cir,Canal Fulton,(866) 682-6586,M,Married
19,52,Heiderose Blind,Jude_High169@hotmail.com,NULL,Stoke-on-Trent,(684) 186-0087,F,Married
20,54,Hemma Küchenmeister,Alarcon@hotmail.com,West Bountiful,Liverpool,(868) 864-8718,M,Married
21,60,Pontianus Unger,Shayne_Britton589@hotmail.com,Cleburne,Huddersfield,(812) 252-0427,F,Married
22,61,Berengar Gering,mxwygtmf_ahjpwboxdy@hotmail.com,Valdosta,Walsall,(977) 813-8110,M,Married
23,67,Catrin Niemann,rfgxqoso9811@hotmail.com,Madera,Bolton,(552) 037-7186,M,Married
24,68,Conny Dippel,Violette_Maxey368@hotmail.com,Burbank,Watford,(247) 811-3933,F,Married
25,75,Dieter Gardenberg,Killian@outlook.com,NULL,Crawley,NULL,F,Married
26,76,Rüder Geller,Maness@outlook.com,NULL,Ipswich,(104) 855-4937,M,Married
27,77,California Zeiger,KimberlieCrocker@outlook.com,Malone,Bradford,(273) 600-9445,M,Married
28,79,Lisa-Maria Geller,Tiffanie.Romero27@outlook.com,Coachella,Manchester,(442) 344-5339,M,Married
29,80,Aurion Stumpf,Gable@hotmail.com,Aberdeen,Plymouth,(535) 013-0514,F,Married
30,82,Cölestin Köstlin,Raynor8@hotmail.com,Satellite Beach,Dudley,(610) 362-5075,M,Married
31,84,Balte Feierbach,Batson@hotmail.com,Washington Court House,Northampton,(845) 678-6842,M,Married
32,86,Dietlana Kronberg,SeeleyJ@hotmail.com,Melrose Park,Poole,(135) 721-2385,M,Married
33,88,Diepold Buchholz,Monty.Swan5@outlook.com,Lakeland,Southend-on-Sea,(649) 790-3129,M,Married
34,89,Janeric Pritzel,SteinerK@hotmail.com,Herndon,Brighton,(861) 866-2316,F,Married
35,92,Haiko Zenner,Caballero313@hotmail.com,Cheboygan,Birmingham,NULL,M,Married
36,97,Justus Dannenberg,NULL,Picayune,Blackburn,(995) 647-4714,F,Married
37,100,Friederun Appel,Mcnamara616@hotmail.com,Ste. Genevieve,Exeter,(866) 682-6586,M,Married

In [55]:
No_Casados

,Id_num,Nombre,Correo,Direccion,Ciudad,Telefono,Genero,Estado_Civil
0,1,Letha Bolt,AbrahamAcevedo@gmail.com,2638 Riverview Pkwy,Wabash,(564) 517-5025,M,Divorced
1,3,Marcos Abraham,Bauer@gmail.com,80 White Woodfort Ln,Clayton,(260) 313-6443,M,Single
2,5,Adolph Francisco,gndd9978@gmail.com,3755 Red Burwood Way,Mount Horeb,(451) 929-8321,M,Single
3,6,Oma Lawler,NULL,NULL,Kings Point,(133) 683-0582,F,Single
4,7,Felix Alba,Palmer_Lofton@gmail.com,3813 Hope St,Hoopeston,(765) 713-9006,F,Widow
...,...,...,...,...,...,...,...,...
57,94,Annalena Genkel,Jewel.Albers24@outlook.com,Lewisville,Portsmouth,(864) 550-3567,F,NULL
58,95,Haita Rosenblatt,NULL,NULL,Bristol,(360) 865-3659,F,Single
59,96,Yente Ulbricht,Oliva_Caskey572@hotmail.com,Watauga,St Helens,(598) 443-5163,M,Single
60,98,Ottfried Schneidermann,Nannie_Farr@outlook.com,Allegan,Leicester,(447) 684-3013,F,Single
61,99,Almute Ebert,mcvgy02@hotmail.com,Katy,Reading,NULL,M,NULL

In [56]:
gmail

,Id_num,Nombre,Correo,Direccion,Ciudad,Telefono,Genero,Estado_Civil
0,1,Letha Bolt,AbrahamAcevedo@gmail.com,2638 Riverview Pkwy,Wabash,(564) 517-5025,M,Divorced
1,2,Vanita Kelleher,Jude_High169@gmail.com,NULL,Concord,(684) 186-0087,F,Married
2,3,Marcos Abraham,Bauer@gmail.com,80 White Woodfort Ln,Clayton,(260) 313-6443,M,Single
3,4,Miyoko Mckinney,Alarcon@gmail.com,925 Hope St,Scottdale,(868) 864-8718,M,Married
4,5,Adolph Francisco,gndd9978@gmail.com,3755 Red Burwood Way,Mount Horeb,(451) 929-8321,M,Single
5,7,Felix Alba,Palmer_Lofton@gmail.com,3813 Hope St,Hoopeston,(765) 713-9006,F,Widow
6,8,Eusebia Noland,Abernathy@gmail.com,1168 Lake Circle,Concord,(447) 838-0332,F,Single
7,9,Denisha Mcginnis,Adaline_Abbott@gmail.com,74 Burwood Way,Brookings,(730) 273-6683,F,Single
8,10,Stanford Sullivan,Shayne_Britton589@gmail.com,3836 Hunting Hill Pkwy,Beavercreek,(812) 252-0427,F,Married
9,11,Nathan Salisbury,mxwygtmf_ahjpwboxdy@gmail.com,3603 Stonewood Ct,Dublin,(977) 813-8110,M,Married
10,13,Adah Jameson,Ivan.Southern98@gmail.com,NULL,Bedford Heights,(914) 159-1651,M,Single
11,14,Adam Geer,Darell_Centeno27@gmail.com,402 Bayview Avenue,Aberdeen,(961) 069-2786,M,Single
12,16,Laura Barger,GregoryMurrell@gmail.com,3744 Woodhurst Pkwy,Chickasaw,(790) 495-8216,F,Single
13,17,Ariel Hermann,rfgxqoso9811@gmail.com,683 SW Stonewood Way,Brigantine,(552) 037-7186,M,Married
14,18,Adam Maddox,Violette_Maxey368@gmail.com,2254 W Riverview Lane,Merrill,(247) 811-3933,F,Married
15,19,Winnifred Brantley,Sanderson@gmail.com,1314 New Glenwood Hwy,Lincoln Park,(594) 490-9628,M,Divorced
16,20,Gayle Baugh,Dennis@gmail.com,781 North Hunting Hill Ln,Lompoc,(438) 866-0472,M,Single
17,21,Delcie Abney,Shifflett@gmail.com,502 New Highland Highway,Madisonville,(227) 049-9918,M,NULL
18,22,Kasey Furr,Abbie.Watts@gmail.com,2961 Deepwood Dr,Arlington,(768) 693-9345,M,Divorced
19,23,Gertie Abel,AlessandraNMckenzie72@gmail.com,1156 Town Avenue,North Richland Hills,(487) 479-9336,F,Widowed
20,24,Myles Angel,mivxztrm_txjxxsw@gmail.com,2008 Town Cir,Brenham,(857) 863-6779,M,Single
21,28,Elli Robertson,oxdngcmz8118@gmail.com,51 Stonewood Pkwy,Sheridan,(553) 638-6830,M,Divorced
22,30,Melia Gates,Gable@gmail.com,75 Beachwood Way,San Angelo,(535) 013-0514,F,Married
23,31,Marc Pickering,Myrtle_Bernard@gmail.com,222 Burwood Pkwy,Fair Haven,(875) 375-2382,F,Single
24,32,Alida Jobe,Raynor8@gmail.com,959 East Meadowview Drive,Snoqualmie,(610) 362-5075,M,Married
25,33,Cordelia Key,Sipes449@gmail.com,2004 Mountain Dr,Philadelphia,(243) 459-7372,M,Single
26,34,Reba Gregg,Batson@gmail.com,2008 3rd Ct,Valdosta,(845) 678-6842,M,Married
27,36,Oliva Coble,SeeleyJ@gmail.com,2274 E Lake Ct,Ringwood,(135) 721-2385,M,Married
28,37,Corey Musgrove,AbbieAbel@gmail.com,1052 Deepwood Cir,Walnut Ridge,(533) 039-4249,M,Divorced
29,39,Newton Graves,SteinerK@gmail.com,2747 W Hope Hwy,Star,(861) 866-2316,F,Married
30,40,Tamica Goins,Daily37@gmail.com,3082 West Quailwood Loop,Lewisville,(403) 014-5022,F,Single
31,41,Bertram Herzog,AddieTrice329@gmail.com,609 Rose Hill Court,Winthrop Harbor,(153) 734-4222,M,Single
32,42,Malcolm Coward,Caballero313@gmail.com,238 Pine Tree Dr,Park Ridge,NULL,M,Married
33,46,Shonda Leake,Oliva_Caskey572@gmail.com,327 New Church St,Albion,(598) 443-5163,M,Single
34,49,Aimee Stamm,mcvgy02@gmail.com,806 Rose Hill Highway,Clarksville,NULL,M,NULL
35,50,Sonia Ackerman,Mcnamara616@gmail.com,3566 Old Hope Cir,Canal Fulton,(866) 682-6586,M,Married

In [57]:
alumnos_A

,Id_num,Nombre,Correo,Direccion,Ciudad,Telefono,Genero,Estado_Civil
0,5,Adolph Francisco,gndd9978@gmail.com,3755 Red Burwood Way,Mount Horeb,(451) 929-8321,M,Single
1,13,Adah Jameson,Ivan.Southern98@gmail.com,NULL,Bedford Heights,(914) 159-1651,M,Single
2,14,Adam Geer,Darell_Centeno27@gmail.com,402 Bayview Avenue,Aberdeen,(961) 069-2786,M,Single
3,17,Ariel Hermann,rfgxqoso9811@gmail.com,683 SW Stonewood Way,Brigantine,(552) 037-7186,M,Married
4,18,Adam Maddox,Violette_Maxey368@gmail.com,2254 W Riverview Lane,Merrill,(247) 811-3933,F,Married
5,32,Alida Jobe,Raynor8@gmail.com,959 East Meadowview Drive,Snoqualmie,(610) 362-5075,M,Married
6,48,Alphonso Meeks,Nannie_Farr@outlook.com,2621 Mountain Circle,Cahokia,(447) 684-3013,F,Single
7,49,Aimee Stamm,mcvgy02@gmail.com,806 Rose Hill Highway,Clarksville,NULL,M,NULL
8,63,Adine Abicht,Ivan.Southern98@hotmail.com,NULL,Peterborough,(914) 159-1651,M,Single
9,66,Amrei Menger,GregoryMurrell@hotmail.com,Presque Isle,Newcastle upon Tyne,(790) 495-8216,F,Single
10,69,Armgard Gerngross,Sanderson@hotmail.com,El Monte,Coventry,(594) 490-9628,M,Divorced
11,80,Aurion Stumpf,Gable@hotmail.com,Aberdeen,Plymouth,(535) 013-0514,F,Married
12,83,Abeline Gelen,Sipes449@hotmail.com,Amsterdam,Swindon,(243) 459-7372,M,Single
13,90,Adriane Finkelstein,Daily37@hotmail.com,Warwick,Norwich,(403) 014-5022,F,Single
14,93,Avenell Rüdiger,uvrguf247@outlook.com,Olympia Fields,Eastbourne,(821) 308-8608,F,Single
15,94,Annalena Genkel,Jewel.Albers24@outlook.com,Lewisville,Portsmouth,(864) 550-3567,F,NULL
16,99,Almute Ebert,mcvgy02@hotmail.com,Katy,Reading,NULL,M,NULL

In [58]:
alumnos_not_A

,Id_num,Nombre,Correo,Direccion,Ciudad,Telefono,Genero,Estado_Civil
0,1,Letha Bolt,AbrahamAcevedo@gmail.com,2638 Riverview Pkwy,Wabash,(564) 517-5025,M,Divorced
1,2,Vanita Kelleher,Jude_High169@gmail.com,NULL,Concord,(684) 186-0087,F,Married
2,3,Marcos Abraham,Bauer@gmail.com,80 White Woodfort Ln,Clayton,(260) 313-6443,M,Single
3,4,Miyoko Mckinney,Alarcon@gmail.com,925 Hope St,Scottdale,(868) 864-8718,M,Married
4,6,Oma Lawler,NULL,NULL,Kings Point,(133) 683-0582,F,Single
...,...,...,...,...,...,...,...,...
78,95,Haita Rosenblatt,NULL,NULL,Bristol,(360) 865-3659,F,Single
79,96,Yente Ulbricht,Oliva_Caskey572@hotmail.com,Watauga,St Helens,(598) 443-5163,M,Single
80,97,Justus Dannenberg,NULL,Picayune,Blackburn,(995) 647-4714,F,Married
81,98,Ottfried Schneidermann,Nannie_Farr@outlook.com,Allegan,Leicester,(447) 684-3013,F,Single
82,100,Friederun Appel,Mcnamara616@hotmail.com,Ste. Genevieve,Exeter,(866) 682-6586,M,Married

<b> <i> <font color=  #FF6600 > Ejercicio 1

De la base de datos Datos_Personales_Python obtén lo siguiente:
    

Los nombres y los correos de las personas registradas en la Tabla 

Los registros de las personas que viven en la ciudad llamada Leicester

Los registros cuya clave lada comience con 8

### <b> <font color=  #6600CC > <i> Filtrando información numérica

In [64]:

server = 'PROBOOK-ROCIO'
bd = 'DB_Python2'
    
try:                               
    
    conexion = pyodbc.connect(driver='{SQL server}', host = server, database = bd)                              
    print('Conexión exitosa')

except: 

    print('La conexión no fué exitosa')
    

    
mayores_30 = pd.read_sql("SELECT * FROM MaratonNY WHERE age >= 30", conexion)

#Between (Incluye los valores que aparecen en la búsqueda)
edad_between = pd.read_sql("SELECT * FROM MaratonNY WHERE age BETWEEN 30 AND 40", conexion)


#Nos aseguramos de cerrar la conexión
conexion.close()

Conexión exitosa

In [65]:
mayores_30

     Corredor  place  gender  age home        time
0          53     54    Male   37   AK  147.333333
1         112    116    Male   43   CO  157.583333
2         191    200    Male   40  GER  163.933333
3         204    213    Male   35   VA  164.500000
4         218    228    Male   33  ESP  165.516667
..        ...    ...     ...  ...  ...         ...
851     23255  23627    Male   45  GBR  478.016667
852     23269  23641    Male   40  IRL  491.566667
853     23273  23645  Female   46   NY  501.550000
854     23282  23654    Male   69   NY  508.083333
855     23290  23662  Female   69   NY  566.783333

[856 rows x 6 columns]

In [66]:
edad_between

     Corredor  place  gender  age home        time
0          53     54    Male   37   AK  147.333333
1         191    200    Male   40  GER  163.933333
2         204    213    Male   35   VA  164.500000
3         218    228    Male   33  ESP  165.516667
4         286    298    Male   33   NY  169.666667
..        ...    ...     ...  ...  ...         ...
438     23143  23514    Male   38  IRL  433.883333
439     23149  23520  Female   32  GBR  434.183333
440     23157  23528    Male   35  IRL  436.233333
441     23250  23622    Male   33   NY  475.366667
442     23269  23641    Male   40  IRL  491.566667

[443 rows x 6 columns]

### <b> <font color=  #6600CC > <i> Filtrando información numérica y no numérica

In [69]:

server = 'PROBOOK-ROCIO'
bd = 'DB_Python2'
    
try:                               
    
    conexion = pyodbc.connect(driver='{SQL server}', host = server, database = bd)                              
    print('Conexión exitosa')

except: 

    print('La conexión no fué exitosa')
    

combinada = pd.read_sql("SELECT * FROM MaratonNY WHERE age > 45 AND gender = 'Female' AND time <250 ", conexion)

combinada_or = pd.read_sql("SELECT * FROM MaratonNY WHERE ((age > 45 AND gender = 'Female') OR (age > 55 AND gender = 'Male')) AND time <250 ", conexion)

#Nos aseguramos de cerrar la conexión
conexion.close()

Conexión exitosa

In [70]:
combinada

   Corredor  place  gender  age home        time
0      7863   8051  Female   46   NY  244.850000
1      8697   8899  Female   53  AUS  249.383333

In [71]:
combinada_or

    Corredor  place  gender  age home        time
0        510    532    Male   66  ESP  178.583333
1        535    558    Male   60  ITA  179.516667
2        582    605    Male   57  PAR  180.750000
3       2238   2319    Male   61  VEN  207.166667
4       4648   4781    Male   56  FRA  224.650000
5       4690   4823    Male   64  JPN  227.416667
6       5120   5260    Male   56  ITA  230.050000
7       6038   6197    Male   58  GBR  234.316667
8       7508   7693    Male   57  FRA  240.466667
9       7863   8051  Female   46   NY  244.850000
10      7941   8133    Male   61  FRA  244.300000
11      8386   8585    Male   61   NJ  247.750000
12      8697   8899  Female   53  AUS  249.383333
13      9683   9896    Male   60  GER  249.033333

<b> <i> <font color=  #FF6600 > Ejercicio 2

De la base de datos MaratonNY obtén lo siguiente:
    
Las mujeres Neoyorquinas que participaron en la carrera

Los hombres y mujeres provenientes de italia que hayan hecho más de 300 minutos en llegar a la meta

### <b> <font color=  #6600CC > <i> Select dentro de Select

In [82]:

server = 'PROBOOK-ROCIO'
bd = 'DB_Python2'
    
try:                               
    
    conexion = pyodbc.connect(driver='{SQL server}', host = server, database = bd)                              
    print('Conexión exitosa')

except: 

    print('La conexión no fué exitosa')
    
    
Veloz_mujer_aus = pd.read_sql("SELECT age, gender, time FROM MaratonNY WHERE time <= (SELECT time FROM MaratonNY WHERE gender = 'Female' AND home = 'AUS') AND gender= 'Female' ", conexion)

#Nos aseguramos de cerrar la conexión
conexion.close()

Conexión exitosa

In [83]:
Veloz_mujer_aus

    age  gender        time
0    26  Female  175.533333
1    30  Female  187.733333
2    42  Female  190.933333
3    36  Female  193.316667
4    35  Female  194.950000
..  ...     ...         ...
65   20  Female  244.883333
66   22  Female  249.316667
67   53  Female  249.383333
68   23  Female  247.316667
69   30  Female  248.766667

[70 rows x 3 columns]

In [89]:

server = 'PROBOOK-ROCIO'
bd = 'DB_Python2'
    
try:                               
    
    conexion = pyodbc.connect(driver='{SQL server}', host = server, database = bd)                              
    print('Conexión exitosa')

except: 

    print('La conexión no fué exitosa')
    
    
hombres_mujer_aus = pd.read_sql("SELECT age, gender, home, time FROM MaratonNY WHERE time >= (SELECT time FROM MaratonNY WHERE gender = 'Female' AND home = 'AUS') AND gender= 'Male' ", conexion)

#Nos aseguramos de cerrar la conexión
conexion.close()

Conexión exitosa

In [90]:
hombres_mujer_aus

     age gender home        time
0     53   Male  NED  249.683333
1     44   Male   NJ  251.366667
2     22   Male   VT  250.716667
3     30   Male   NY  251.583333
4     48   Male  NOR  251.833333
..   ...    ...  ...         ...
386   73   Male   NY  460.800000
387   33   Male   NY  475.366667
388   45   Male  GBR  478.016667
389   40   Male  IRL  491.566667
390   69   Male   NY  508.083333

[391 rows x 4 columns]

### <b> <font color=  #6600CC > <i> Ordenando la Información

ORDER BY

In [92]:

server = 'PROBOOK-ROCIO'
bd = 'DB_Python2'
    
try:                               
    
    conexion = pyodbc.connect(driver='{SQL server}', host = server, database = bd)                              
    print('Conexión exitosa')

except: 

    print('La conexión no fué exitosa')
    
    
hombres_mujer_aus = pd.read_sql("SELECT age, gender, home, time FROM MaratonNY WHERE time >= (SELECT time FROM MaratonNY WHERE gender = 'Female' AND home = 'AUS') AND gender= 'Male' ORDER BY time DESC  ", conexion)

#Nos aseguramos de cerrar la conexión
conexion.close()

Conexión exitosa

In [88]:
hombres_mujer_aus

     age gender        time
0     69   Male  508.083333
1     40   Male  491.566667
2     45   Male  478.016667
3     33   Male  475.366667
4     73   Male  460.800000
..   ...    ...         ...
386   41   Male  250.916667
387   30   Male  250.800000
388   22   Male  250.716667
389   33   Male  250.150000
390   53   Male  249.683333

[391 rows x 3 columns]

In [97]:

server = 'PROBOOK-ROCIO'
bd = 'DB_Python2'
    
try:                               
    
    conexion = pyodbc.connect(driver='{SQL server}', host = server, database = bd)                              
    print('Conexión exitosa')

except: 

    print('La conexión no fué exitosa')
    
    
hombres_mujer_aus = pd.read_sql("SELECT age, gender, home, time FROM MaratonNY WHERE time >= (SELECT time FROM MaratonNY WHERE gender = 'Female' AND home = 'AUS') AND gender= 'Male' ORDER BY age, time DESC ", conexion)

#Nos aseguramos de cerrar la conexión
conexion.close()

Conexión exitosa

In [98]:
hombres_mujer_aus

     age gender  home        time
0      5   Male  None  302.683333
1     18   Male   MEX  408.333333
2     20   Male   GBR  284.083333
3     21   Male    CT  329.250000
4     21   Male    FL  276.650000
..   ...    ...   ...         ...
386   72   Male    ID  254.833333
387   73   Male    NY  460.800000
388   73   Male    NJ  400.716667
389   76   Male    NY  430.816667
390   81   Male   ITA  389.000000

[391 rows x 4 columns]

<b> <i> <font color=  #FF6600 > Ejercicio 3

### <b> <font color=  #6600CC > <i> Extrayendo valores únicos con el comando Distinct

In [99]:

server = 'PROBOOK-ROCIO'
bd = 'DB_Python2'
    
try:                               
    
    conexion = pyodbc.connect(driver='{SQL server}', host = server, database = bd)                              
    print('Conexión exitosa')

except: 

    print('La conexión no fué exitosa')
    
    
valores_unicos = pd.read_sql("SELECT DISTINCT home FROM MaratonNY ORDER BY home", conexion)

#Nos aseguramos de cerrar la conexión
conexion.close()

Conexión exitosa

In [100]:
valores_unicos

    home
0   None
1     AK
2    ARG
3    AUS
4    AUT
..   ...
68    VA
69   VEN
70    VT
71    WA
72    WI

[73 rows x 1 columns]

### <b> <font color=  #6600CC > <i> Funciones de Agrupamiento (sum, count, min, max y average)

In [205]:

server = 'PROBOOK-ROCIO'
bd = 'DB_Python2'
    
try:                               
    
    conexion = pyodbc.connect(driver='{SQL server}', host = server, database = bd)                              
    print('Conexión exitosa')

except: 

    print('La conexión no fué exitosa')
    
    
suma = pd.read_sql("SELECT SUM(time)FROM MaratonNY", conexion)

cantidades = pd.read_sql("SELECT COUNT(time)FROM MaratonNY", conexion)

minimo = pd.read_sql("SELECT MIN(time)FROM MaratonNY", conexion)

maximo = pd.read_sql("SELECT MAX(time)FROM MaratonNY", conexion)

promedio = pd.read_sql("SELECT AVG(time)FROM MaratonNY", conexion)

cantidad_paises = pd.read_sql("SELECT COUNT(DISTINCT(home)) FROM MaratonNY", conexion)

#Nos aseguramos de cerrar la conexión
conexion.close()

Conexión exitosa

In [206]:
suma

0  268570.7

In [207]:
type(suma)

pandas.core.frame.DataFrame

In [208]:
print(f'La suma de los tiempos es {suma.iloc[0][0]}')
print(f'La cantidad de tiempos registrados es {cantidades.iloc[0][0]}')
print(f'El tiempo mínimo registrado es {minimo.iloc[0][0]}')
print(f'El tiempo máximo registrado es {maximo.iloc[0][0]}')
print(f'El tiempo promedio registrado es {promedio.iloc[0][0]}')
print(f'En el maratón participaron {cantidad_paises.iloc[0][0]} paises')

La suma de los tiempos es 268570.70000049984
La cantidad de tiempos registrados es 1000
El tiempo mínimo registrado es 147.3333333
El tiempo máximo registrado es 566.7833333
El tiempo promedio registrado es 268.57070000049987
En el maratón participaron 72 paises

<b> <i> <font color=  #FF6600 > Ejercicio 4

Aplica estas funciones de agrupamiento a la información correspondiente a las edades de los corredores y despliega cada una en pantalla con su leyenda correspondiente

<b> <font color=  #FF00FF > <i> Accesando a los valores de un dataframe con loc e iloc

Pandas tiene dos funciones que permiten accesar más fácilmente a la información contenida en un Dataframe

Estas dos funciones son loc e iloc

Cuando conocemos los nombres de las filas y las columnas, podemos utilizar la función loc y cuando no los conocemos o queremos hacer referencia a las mismas por medio de números, utilizamos iloc (la "i" hace referencia a "integer")

<b> <font color=  #FF00FF > <i> Ejemplos con iloc

In [145]:
carreras

     Corredor  place  gender  age home        time
0        3475   3592    Male   52  GBR  217.483333
1       13594  13853  Female   40   NY  272.550000
2       12012  12256    Male   31  FRA  265.283333
3       10236  10457  Female   33   MI  256.150000
4        9476   9686    Male   33   NY  252.250000
..        ...    ...     ...  ...  ...         ...
995     15972  16261    Male   61  FRA  285.883333
996      1090   1131    Male   37  GBR  191.916667
997     16419  16713  Female   53  IRL  289.016667
998     13977  14241  Female   21   NY  276.050000
999      8527   8726    Male   55  GER  240.966667

[1000 rows x 6 columns]

In [143]:
type(carreras)

pandas.core.frame.DataFrame

In [156]:
carreras[1,2] #Aún cuando "carreras" es un dataframe, este código nos arrojará un error

KeyError: (1, 2)

In [201]:
carreras.iloc[1][2] #Para obtener la información que se encuentra en la fila 1, columna 2, utilizamos iloc

'Female'

In [168]:
carreras.iloc[1,2] #Para obtener la información que se encuentra en la fila 1, columna 2, utilizamos iloc

'Female'

In [202]:
carreras.loc[1]["gender"] #Aquí utilizamos el número uno para la fila debido a que las filas no tienen un nombre

'Female'

In [170]:
carreras.loc[1,"gender"] #Aquí utilizamos el número uno para la fila debido a que las filas no tienen un nombre

'Female'

In [169]:
carreras.iloc[1] #Para obtener la información que se encuentra en la fila 1

Corredor     13594
place        13853
gender      Female
age             40
home            NY
time        272.55
Name: 1, dtype: object

In [173]:
carreras.iloc[2:5] #Trae las filas 2 a 4

   Corredor  place  gender  age home        time
2     12012  12256    Male   31  FRA  265.283333
3     10236  10457  Female   33   MI  256.150000
4      9476   9686    Male   33   NY  252.250000

In [175]:
carreras.iloc[2:5, [2,3]] #Trae las filas 2 a 4, pero solamente las columnas gender y age

   gender  age
2    Male   31
3  Female   33
4    Male   33

In [178]:
carreras.iloc[2:5, 2:5] #Trae las filas 2 a 4 y las columnas de gender a age 
                        #Cuando se le pide un rango de valores no se utilizan corchetes
                        #Los rangos toman en cuenta un número menos en la cifra que se encuentra a la derecha de los dos puntos

   gender  age home
2    Male   31  FRA
3  Female   33   MI
4    Male   33   NY

In [179]:
carreras.iloc[[2,5], [2,5]] #Trae las filas 2 y 5, y las columnas gender y time (la segunda y la quinta)

  gender        time
2   Male  265.283333
5   Male  201.966667

In [180]:
carreras.set_index("Corredor", inplace=True) #Con set_index le indicamos que la columna Corredor contiene los nombres de las filas
                                             #Con inplace=True le indicamos que el cambio se quedará guardado en el dataframe Carreras

In [181]:
carreras.loc[13594,"gender"] #Ahora que ya las filas tienen un nombre, podemos pasarle el número de corredor en las filas

'Female'

In [182]:
carreras.loc[13594,["gender", "age", "home","time"]]

gender    Female
age           40
home          NY
time      272.55
Name: 13594, dtype: object

In [183]:
carreras.loc[13594,"gender":"time"]

gender    Female
age           40
home          NY
time      272.55
Name: 13594, dtype: object

In [190]:
carreras.loc[13594:9476, "gender":"time"]

          gender  age home        time
Corredor
13594     Female   40   NY  272.550000
12012       Male   31  FRA  265.283333
10236     Female   33   MI  256.150000
9476        Male   33   NY  252.250000

In [193]:
carreras.iloc[1:5, 1:5] #En las columnas, ahora gender ya es la número 1 debido a que Corredor ya es un indice y no una columna

          gender  age home        time
Corredor
13594     Female   40   NY  272.550000
12012       Male   31  FRA  265.283333
10236     Female   33   MI  256.150000
9476        Male   33   NY  252.250000

<b> <i> <font color=  #FF6600 > Ejercicio 5

Vuelve a cargar la información del archivo MaratonNY y obtén la información correspondiente a las columnas place y time utilizando tanto la función loc como  la función iloc

## <font color= #0000FF> <i> Tarea

Aplicar cada una de estas funciones en la información contenida en la base de datos que creaste en la tarea número 11